{
  "id": "11-16_saint_rufinus",
  "name": "Saint Rufinus",
  "mmdd": "11-16",
  "feast": "The Sixteenth Day of November",
  "summary": "The Roman Martyrology records eleven saints named Rufinus:On 28 February, a Roman martyr, Rufinus, with several companions in martyrdom; nothing is known concerning them. On 7 April, an African martyr, Rufinus with two companions; their names are mentioned under 6 April in a list of martyrs in the \"Martyrologium Hieronymianum\".",
  "biography": "The Roman Martyrology records eleven saints named Rufinus:On 28 February, a Roman martyr, Rufinus, with several companions in martyrdom; nothing is known concerning them.\nOn 7 April, an African martyr, Rufinus with two companions; their names are mentioned under 6 April in a list of martyrs in the \"Martyrologium Hieronymianum\".\nOn 14 June, the two martyrs, Valerius and Rufinus, who suffered at Soissons, during the Diocletian persecution; their names are given under this date in the \"Martyrologium Hieronymianum\".\nOn 21 June, Rufinus who suffered martyrdom with Martia at Syracuse; nothing is known concerning him.\nOn 30 July, Rufinus of Assisi, who was reportedly the bishop of this city and a martyr. He is probably identical with the \"episcopus Marsorum\" noted under 11 August. The Acts of the martyrdom of this Rufinus are purely legendary [cf. \"Bibliotheca hagiographica latina\", II, 1068; Elisei, \"Studio sulla chiesa cattedrale di S. Rufino\" ; D. de Vincentiis, \"Notizie di S. Rufino\" ].\nOn 19 August, Rufinus, confessor at Mantua.\nOn 26 August, a confessor, Rufinus, venerated at Capua ; his name is given in the \"Martyrologium Hieronymianum\" under 26 and 27 August.\nOn 4 September, a martyr, Rufinus, with his companions in martyrdom who suffered at Ancyra in Galatia; he is also mentioned in company with several others in the \"Martyrologium Hieronymianum\" under 31 August, and again under 4 September.\nOn 9 September, Rufinus and Rufinianus, with no further particulars.\nOn 16 November, Rufinus, a martyr in Africa with several companions in martyrdom; nothing is known concerning this saint.\nUnder 22 June the martyr Rufinus of Alexandria is mentioned in the \"Martyrologium Hieronymianum\" names..",
  "prayers": [],
  "sources": [
    "https://en.wikipedia.org/wiki/Saints_Rufinus",
    "Wikipedia (CC BY-SA) — text attribution required.",
    "https://en.wikipedia.org/wiki/Rufinus"
  ]
}
