{
  "id": "11-28_saint_rufus",
  "name": "Saint Rufus",
  "mmdd": "11-28",
  "feast": "The Twenty-Eighth Day of November",
  "summary": "There are several saints named Rufus, of which the Roman Martyrology records ten; historical mention is made of the following ones, which have liturgical feasts:On 19 April, a group of martyrs in Melitene in Armenia, one of whom bears the name of Rufus. These martyrs are mentioned already in the Martyrologium Hieronymianum.",
  "biography": "There are several saints named Rufus, of which the Roman Martyrology records ten; historical mention is made of the following ones, which have liturgical feasts:On 19 April, a group of martyrs in Melitene in Armenia, one of whom bears the name of Rufus. These martyrs are mentioned already in the Martyrologium Hieronymianum.\nOn 1 August, Rufus, with several companions who, according to the most reliable manuscripts of the \"Martyrologium Hieronymianum\" died at Tomi, the place being afterwards by mistake changed to Philadelphia.\nOn 27 August, two martyrs named Rufus at Capua -- one, whose name also appears as Rufinus in the \"Martyrologium Hieronymianum\". The other is said to have suffered with a companion, Carpophorus, in Diocletian's persecution circa 304 AD.\nOn 25 September, several martyrs at Damascus, among them one named Rufus.\nOn 7 November, a Rufus of Metz, who is said to have been Bishop of Metz; his history, however, is legendary. His name was inserted at a later date in an old manuscript of the \"Martyrologium Hieronymianum\"(ed. cit., 140). In the ninth century his relics were transferred to Gau-Odernheim in Hesse, Diocese of Mainz.\nOn 12 November, Rufus, legend, without any historical proof, the supposed first Bishop of Avignon, who is perhaps identical with Rufus, the disciple of Paul.\nOn 21 November, Rufus the disciple of the Apostles, who lived at Rome and to whom Saint Paul sent a greeting, as well as he did also to the mother of Rufus. St. Mark says in his Gospel that Simon of Cyrene was the father of Rufus, and as Mark wrote his Gospel for the Roman Christians, this Rufus is probably the same as the one to whom Paul sent a salutation.\nOn 28 November, a Roman martyr Rufus, probably identical with the Rufinianus who was buried in the Catacomb of Generosa on the Via Portuensis, and who is introduced in the legendary Acts of the martyrdom of St. Chrysogonus.\nOn 18 December, the holy martyrs Rufus and Zosimus, who were taken to Rome with St. Ignatius of Antioch and were put to death there for their unwavering confession of Christianity during the persecution of Trajan. St. Polycarp speaks of them in his letter to the Philippians.",
  "prayers": [],
  "sources": [
    "https://en.wikipedia.org/wiki/Rufus_of_Metz",
    "Wikipedia (CC BY-SA) — text attribution required.",
    "https://en.wikipedia.org/wiki/Rufus",
    "https://en.wikipedia.org/wiki/Saint_Rufus"
  ]
}
